carecarma/protected/humhub/modules/user/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `user` WHERE `id`=1