carecarma/protected/humhub/modules/notification/controllers/ListController.php

    public static function getUpdates()
    {

        $user = Yii::$app->user->getIdentity();




        $query = Notification::find()->where(['seen' => 0])->orWhere(['IS', 'seen', new \yii\db\Expression('NULL')])->andWhere(['user_id' => $user->id]);

        $update['newNotifications'] = $query->count();

        $query->andWhere(['desktop_notified' => 0]);

        $update['notifications'] = array();
        foreach ($query->all() as $notification) {
---
SELECT COUNT(*) FROM `notification` WHERE ((`seen`=0) OR (`seen` IS NULL)) AND (`user_id`=1)
SELECT * FROM `notification` WHERE (((`seen`=0) OR (`seen` IS NULL)) AND (`user_id`=1)) AND (`desktop_notified`=0)