carecarma/protected/humhub/modules/mail/controllers/MailController.php

    private function getMessage($id)
    {
        $message = Message::findOne(['id' => $id]);

        if ($message != null) {

            $userMessage = UserMessage::findOne([
                'user_id' => Yii::$app->user->id,
                'message_id' => $message->id
            ]);
---
SELECT * FROM `message` WHERE `id`=30
SELECT * FROM `user_message` WHERE (`user_id`=1) AND (`message_id`=30)