carecarma/protected/humhub/modules/mail/models/Message.php

    public function seen($userId)
    {
        // Update User Message Entry
        $userMessage = UserMessage::findOne(array(
                    'user_id' => $userId,
                    'message_id' => $this->id
        ));
        if ($userMessage !== null) {
            $userMessage->last_viewed = new \yii\db\Expression('NOW()');
            $userMessage->save();
---
SELECT * FROM `user_message` WHERE (`user_id`=1) AND (`message_id`=30)
UPDATE `user_message` SET `last_viewed`=NOW(), `updated_at`=NOW() WHERE (`message_id`=30) AND (`user_id`=1)