carecarma/protected/humhub/modules/mail/models/UserMessage.php

SELECT COUNT(*) FROM `user_message` LEFT JOIN `message` ON `user_message`.`message_id` = `message`.`id` WHERE ((`user_message`.`user_id`=1) AND (message.updated_at > user_message.last_viewed OR user_message.last_viewed IS NULL)) AND (`message`.`updated_by` <> 1)
---
    public static function getNewMessageCount($userId = null)
    {
        if ($userId === null) {
            $userId = Yii::$app->user->id;
        }

        $json = array();

        $query = self::find();
        $query->joinWith('message');
        $query->where(['user_message.user_id' => $userId]);
        $query->andWhere("message.updated_at > user_message.last_viewed OR user_message.last_viewed IS NULL");
        $query->andWhere(["<>", 'message.updated_by', $userId]);

        return $query->count();