carecarma/protected/humhub/models/ModuleEnabled.php

    public static function getEnabledIds()
    {
        $enabledModules = Yii::$app->cache->get(self::CACHE_ID_ALL_IDS);
        if ($enabledModules === false) {
            $enabledModules = [];
            foreach (\humhub\models\ModuleEnabled::find()->all() as $em) {
---
SELECT * FROM `module_enabled`